---
kind: type
id: T:Autodesk.Revit.DB.DirectShapeTypeOptions
source: html/ce6d1f15-bceb-5ad2-f3d1-d93f0447da44.htm
---
# Autodesk.Revit.DB.DirectShapeTypeOptions

This class is used to control behavior of a DirectShapeType object.

## Syntax (C#)
```csharp
public class DirectShapeTypeOptions : IDisposable
```

## Remarks
Use Enable/Disable functions to change the default behavior.
 Use DirectShapeType.SetOptions to modify that object's behavior.